{
  "backend/main.mo": "Actor storing per-caller conversion history, allowing entries to be added and retrieved sorted by timestamp.",
  "feature_evidence.json": "Defines feature-to-file mappings and metadata describing supported app capabilities and test coverage.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for major frontend files used as build planning reference.",
  "frontend/index.css": "Tailwind base styles and theme variables defining the app’s warm neutral color palette for light and dark modes.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level React component managing the full conversion flow, state transitions, and history panel rendering.",
  "frontend/src/components/BrandHeader.tsx": "Renders the branded header with logo, title, and tagline.",
  "frontend/src/features/converter/ConverterForm.tsx": "Form for entering and validating TikTok URLs before conversion flow begins.",
  "frontend/src/features/converter/DownloadPanel.tsx": "Runs the demo conversion, shows output settings and progress, and triggers file download.",
  "frontend/src/features/converter/EmptyStateHero.tsx": "Landing hero section introducing the app and guiding users to start a conversion.",
  "frontend/src/features/converter/PresetPicker.tsx": "Renders a selectable grid of conversion presets using cards and a radio group.",
  "frontend/src/features/converter/presets.ts": "Defines conversion preset metadata and provides a lookup function by ID.",
  "frontend/src/features/converter/useMp4Export.ts": "Implements a mock MP4 export hook that generates a JPEG frame and tracks progress/errors.",
  "frontend/src/features/converter/validators.ts": "Validates TikTok URLs and returns structured validation results.",
  "frontend/src/features/history/HistoryPanel.tsx": "Displays conversion history with table view, links, and delete actions.",
  "frontend/src/features/history/historyStorage.ts": "Manages localStorage persistence for conversion history entries.",
  "frontend/src/features/history/historyTypes.ts": "Declares the HistoryEntry type used for conversion history records.",
  "frontend/src/features/history/useHistory.ts": "Combines backend and local conversion history with add/delete operations via React Query.",
  "frontend/src/features/results/ResultsScreen.tsx": "Shows the conversion result preview, download button, preset info, and YouTube upload steps.",
  "frontend/src/features/results/uploadGuidance.ts": "Contains static step-by-step guidance for uploading converted videos to YouTube.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity auth state and interactions using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query hook that fetches conversion history from the backend actor.",
  "frontend/src/index.css": "Configures Tailwind base styles and defines CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClient and InternetIdentity providers.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Project metadata describing requirements, features, assets, and current state."
}