{
  "backend/main.mo": "Actor storing per-caller conversion history with add and query methods using timestamps and sorting.",
  "feature_evidence.json": "Feature evidence report mapping features to related source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color palettes and global styling.",
  "frontend/index.html": "HTML entry point loading the React app root and main script.",
  "frontend/src/App.tsx": "Main React app managing conversion steps, history, and the Share & List tab with social share logic.",
  "frontend/src/appMetadata.ts": "Exports appName and appDescription constants for consistent branding.",
  "frontend/src/components/BrandHeader.tsx": "Header showing the app logo, title, and description using centralized metadata.",
  "frontend/src/features/converter/ConverterForm.tsx": "Form for entering and validating a TikTok URL before starting conversion.",
  "frontend/src/features/converter/DownloadPanel.tsx": "Panel handling demo conversion execution, progress, settings summary, and error display.",
  "frontend/src/features/converter/EmptyStateHero.tsx": "Landing hero with illustration and guidance for starting a TikTok-to-YouTube conversion.",
  "frontend/src/features/converter/PresetPicker.tsx": "UI component rendering selectable video conversion presets using cards and a radio group.",
  "frontend/src/features/converter/presets.ts": "Defines conversion preset types and preset list plus a helper to fetch presets by ID.",
  "frontend/src/features/converter/useMp4Export.ts": "Hook that simulates video conversion progress and generates a demo JPEG frame based on a preset.",
  "frontend/src/features/converter/validators.ts": "Validates TikTok URLs, checking domain and path structure.",
  "frontend/src/features/history/HistoryPanel.tsx": "Displays conversion history in a table with links, metadata, and deletion controls.",
  "frontend/src/features/history/historyStorage.ts": "Manages localStorage CRUD for conversion history entries with a size limit.",
  "frontend/src/features/history/historyTypes.ts": "Defines the shape of a conversion history entry.",
  "frontend/src/features/history/useHistory.ts": "Combines local and backend history, exposes add/delete operations, and manages syncing.",
  "frontend/src/features/market/ListingSection.tsx": "UI instructions for listing the app on Caffeine App Market with a link to Caffeine.ai.",
  "frontend/src/features/market/ShareAndListPanel.tsx": "Combines sharing utilities and listing section into a single panel.",
  "frontend/src/features/market/ShareUtilities.tsx": "Provides a link-sharing UI with clipboard copy support and fallback handling.",
  "frontend/src/features/results/ResultsScreen.tsx": "Displays the conversion result with video preview, download/start-over actions, preset details, and YouTube upload guidance.",
  "frontend/src/features/results/uploadGuidance.ts": "Defines the upload step structure and provides a list of YouTube upload instructions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, stored identity restoration, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Exposes a query hook that fetches a user's conversion history from the backend actor.",
  "frontend/src/index.css": "Sets Tailwind base styles and defines light/dark theme variables and global styling rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/utils/shareLinks.ts": "Generates share URLs for Facebook, X, LinkedIn, and email with encoded parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with theme extensions, color variables, plugins, and responsive container settings.",
  "project_state.json": "Describes the project state, requirements, existing features, and architectural notes for the app."
}