{
  "backend/main.mo": "Motoko actor storing per‑user conversion history with functions to add entries and return them sorted by timestamp.",
  "feature_evidence.json": "Feature evidence report linking a clipboard-copy enhancement to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries for various frontend source files used for reference in build planning.",
  "frontend/index.css": "Tailwind base and theme variables defining warm neutral light/dark palettes and global element styles.",
  "frontend/index.html": "Root HTML file that loads the React app entrypoint at /src/main.tsx.",
  "frontend/src/App.tsx": "Main React component managing conversion steps, history, and share/list tabs within the UI.",
  "frontend/src/appMetadata.ts": "Exports shared constants for the app’s name and description.",
  "frontend/src/components/BrandHeader.tsx": "Header displaying the logo, title, and description using centralized metadata.",
  "frontend/src/features/converter/ConverterForm.tsx": "Form for entering and validating a TikTok URL before starting conversion.",
  "frontend/src/features/converter/DownloadPanel.tsx": "Panel handling demo conversion processing with progress, errors, and download completion callback.",
  "frontend/src/features/converter/EmptyStateHero.tsx": "Hero section shown in idle state with app intro messaging and illustration.",
  "frontend/src/features/converter/PresetPicker.tsx": "UI for selecting a conversion preset using radio-card layout with metadata badges.",
  "frontend/src/features/converter/presets.ts": "Defines the ConversionPreset interface, preset list, and a helper to retrieve presets by ID.",
  "frontend/src/features/converter/useMp4Export.ts": "Implements a hook that simulates video conversion by generating a JPEG preview and tracks progress and errors.",
  "frontend/src/features/converter/validators.ts": "Provides TikTok URL validation ensuring proper domain and path structure.",
  "frontend/src/features/history/HistoryPanel.tsx": "Renders the conversion history table with delete actions and preset lookup.",
  "frontend/src/features/history/historyStorage.ts": "Manages localStorage history retrieval, addition, deletion, and clearing.",
  "frontend/src/features/history/historyTypes.ts": "Defines the HistoryEntry type for saved conversions.",
  "frontend/src/features/history/useHistory.ts": "Combines local and backend history, exposes add and delete operations, and returns merged sorted entries.",
  "frontend/src/features/market/ListingSection.tsx": "Displays steps for listing the app on Caffeine App Market and supports copying submission details.",
  "frontend/src/features/market/ShareAndListPanel.tsx": "Wraps share utilities and listing section into a single panel.",
  "frontend/src/features/market/ShareUtilities.tsx": "Provides UI to copy the current page URL using clipboard APIs with fallback handling.",
  "frontend/src/features/results/ResultsScreen.tsx": "Shows conversion success message, preview, download option, preset details, and YouTube upload instructions.",
  "frontend/src/features/results/uploadGuidance.ts": "Defines an UploadStep interface and a list of step-by-step guidance items for manually uploading converted videos to YouTube.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user's identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Exposes a query hook to fetch a user's conversion history from the backend actor when available.",
  "frontend/src/index.css": "Defines global Tailwind CSS layers and CSS variables for theming in both light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/utils/clipboard.ts": "Implements a safe clipboard write function with modern API usage and fallback support.",
  "frontend/src/utils/shareLinks.ts": "Generates shareable URLs for Facebook, X, LinkedIn, and email with encoded parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom theme extensions, color tokens, typography, animations, and plugins.",
  "project_state.json": "Stores project metadata, features, requirements, and architectural notes for the TikTok-to-YouTube converter app."
}