{
  "kind": "build_request",
  "title": "Add App Market listing and sharing support",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "Add an in-app section that helps the user list the TikTok → YouTube Converter app in the Caffeine App Market, including clear step-by-step instructions and a prominent call-to-action that opens caffeine.ai in a new tab for completing the listing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "List it"
        ]
      },
      "acceptanceCriteria": [
        "When the user views the listing section, they see step-by-step instructions written in English for listing the app in the Caffeine App Market.",
        "A CTA button/link is present and opens https://caffeine.ai/ in a new tab (noopener noreferrer).",
        "The listing section is reachable from the main app UI without requiring authentication."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add sharing utilities to make the live app easy to distribute: show the current app URL, provide a one-click 'Copy link' action, and replace the footer social icons’ placeholder (#) hrefs with real share-intent URLs that share the current app URL.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "List it"
        ]
      },
      "acceptanceCriteria": [
        "A 'Copy link' control copies window.location.href and provides visible success feedback.",
        "Footer social icons no longer use href=\"#\" and instead open share-intent URLs in a new tab with the app URL prefilled.",
        "All generated share URLs correctly URL-encode the app URL.",
        "No social-media API integrations are used (only standard share-intent links)."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Update app metadata/content where appropriate so the app presents well for an App Market audience: ensure the app name and a short description are consistently presented in the header/hero/footer and can be reused in the new listing section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "List it"
        ]
      },
      "acceptanceCriteria": [
        "The app name and a short one-sentence description are displayed consistently and reused in the listing section without duplicating conflicting copy.",
        "All user-facing text is in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose them instead).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "No third-party authentication beyond Internet Identity.",
    "No external backends/databases/services.",
    "Keep backend as a single Motoko actor; only add migration.mo if state schema must change."
  ],
  "nonGoals": [
    "Implementing actual automated submission/listing to the Caffeine App Market via an API (provide guidance and outbound link only).",
    "Implementing monetization, payments, or airdrop logic inside the app.",
    "Adding social-media API integrations (use share-intent links only)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}