{
  "kind": "build_request",
  "title": "Improve App Market submission flow (copyable listing details)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-10",
      "text": "Enhance the in-app Caffeine App Market listing section so the user can quickly submit the app by adding a one-click action to copy the required submission details (app name, app description, and the live app URL) to the clipboard, with clear success/failure feedback.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Yes submit it"
        ]
      },
      "acceptanceCriteria": [
        "In the 'List on Caffeine App Market' card, there is a button (e.g., 'Copy submission details') that copies a single, well-formatted text block containing: appName, appDescription, and the current app URL.",
        "The copied URL uses the same value currently shown in the listing steps (i.e., window.location.origin as used in ListingSection).",
        "On successful copy, the UI shows an affirmative confirmation state similar in clarity to the existing 'Copy Link' interaction in ShareUtilities (e.g., temporary 'Copied!' state).",
        "If clipboard copy fails, the UI shows a visible non-crashing error state (e.g., inline message) and logs the error to the console.",
        "All user-facing text is in English."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (Shadcn UI components are read-only).",
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx.",
    "Keep the backend as a single Motoko actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Automatically submitting the app to the Caffeine App Market (submission is completed by the user on caffeine.ai).",
    "Adding or changing authentication beyond Internet Identity.",
    "Changing the TikTok-to-MP4 conversion workflow or storing raw video bytes on the backend."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}