{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Copyable Caffeine App Market submission details",
  "requirements": [
    {
      "id": "REQ-10",
      "summary": "Add a one-click copy action in the 'List on Caffeine App Market' card to copy a formatted block (app name, description, live URL) with clear success/failure feedback.",
      "acceptanceCriteria": [
        "In the 'List on Caffeine App Market' card, there is a button (e.g., 'Copy submission details') that copies a single, well-formatted text block containing: appName, appDescription, and the current app URL.",
        "The copied URL uses the same value currently shown in the listing steps (i.e., window.location.origin as used in ListingSection).",
        "On successful copy, the UI shows an affirmative confirmation state similar in clarity to the existing 'Copy Link' interaction in ShareUtilities (e.g., temporary 'Copied!' state).",
        "If clipboard copy fails, the UI shows a visible non-crashing error state (e.g., inline message) and logs the error to the console.",
        "All user-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/clipboard.ts",
          "operation": "create",
          "description": "Create a small clipboard helper (writeText with a safe fallback) that returns success/failure so UI can show 'Copied!' vs an inline error message; use this helper for copying the formatted submission details text block."
        },
        {
          "path": "frontend/src/features/market/ListingSection.tsx",
          "operation": "modify",
          "description": "Use the existing shadcn-ui Button/Card layout to add a 'Copy submission details' action that copies a single formatted text block containing appName, appDescription, and window.location.origin; provide a temporary success state (e.g., 'Copied!') similar to ShareUtilities and an inline visible error state on failure while logging errors to the console. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}